doc(): export class-diagram to png
